{"sections":{"rich_text_HkMyPL":{"type":"rich-text","settings":{"full_width":false}},"rich_text_K6paVK":{"type":"rich-text","settings":{"full_width":false}},"rich_text_bkP3rb":{"type":"rich-text","settings":{"full_width":false}},"rich_text_XMx6iU":{"type":"rich-text","settings":{"full_width":false}},"rich_text_6qWCzL":{"type":"rich-text","settings":{"full_width":false}},"rich_text_KPPaXH":{"type":"rich-text","settings":{"full_width":false}},"custom_liquid_7LQTLF":{"type":"custom-liquid","settings":{"custom_liquid":"<hr>"}},"rich_text_mP4rA3":{"type":"rich-text","settings":{"full_width":false}},"rich_text_bixTJR":{"type":"rich-text","settings":{"full_width":false}},"rich_text_cmj8aN":{"type":"rich-text","settings":{"full_width":false}},"rich_text_h6RAT6":{"type":"rich-text","settings":{"full_width":false}},"rich_text_qnyFrf":{"type":"rich-text","settings":{"full_width":false}},"main":{"type":"main-page","disabled":true,"settings":{}},"3478d8e4-dcfd-439c-af1c-624239abf173":{"type":"rich-text","disabled":true,"settings":{"full_width":false}},"f4d4cfe6-0eff-4650-84dc-836db419c644":{"type":"rich-text","disabled":true,"settings":{"full_width":false}},"09f9c2a6-ab8b-4287-b7c8-5311cee9207c":{"type":"job-listing","blocks":{"8bd26a80-afcc-4660-82c0-6e83df68a9ef":{"type":"Job","settings":{"job_title":"Kitchen Production Manager","summary_text":"We're looking for an outstanding Kitchen Production Manager to join our growing team! This is a big job and we're looking for an exceptional cake decorator with at least two years management experience to lead the team in our Park Royal bakery.","location":"park_royal","job_type":"full_time","salary":"£35K – £40K","years_experience":"2+ years experience","start_date":"ASAP","schedule":"","full_description":"<p>We're looking for an outstanding Kitchen Production Manager to join our growing team! This is a big job and we're looking for an exceptional cake decorator with at least two years management experience to lead the team in our Park Royal bakery. We're offering 35K – 40K plus bonus plus signing on bonus for the right candidate. Salary COULD be negotiable for an exceptional outstanding candidate. <br\/><br\/>Our Park Royal Production Manager is responsible for overseeing the baking, making and decorating all Flavourtown cakes, cupcakes, brownies and cookies ordered online from our website! You'll be managing the whole process from ensuring our small-batch baking delivers the amazing treats we're famous for to making sure that every celebration cake that leaves our bakery is the absolute best it can be! <br\/>The quality of what we do and the integrity of our product is paramount to us and we take delivering a best in class product very seriously.<br\/><br\/>We've listed the qualities we're looking for below BUT alongside this, you'll also be decorating cakes to an exceptional standard and jumping in with baking when needed. This isn't an office-based role and we are 100% looking for a hugely experienced cake decorator \/ baker for this position. We need you to arrive and get stuck right in with organising, evolving systems and driving quality to the highest possible levels.<br\/><br\/>Before you read ahead have a look at our website and check out the cakes and bakes we produce and see if you think we'd be a good match for each other! <\/p>","essential_skills":"<p>KEY RESPONSIBILITIES<br\/>You will be managing a team of around 10 people with a baking section and separate cake team in the next room! You already have an excellent Head Baker \/ Assistant Production Manager and we're in the process of recruiting an excellent Head decorator for you as well. <br\/>You'll be overseeing every aspect from making cake batters and frosting to trimming, crumb coating and decorating cakes! You'll also be responsible for quality checking and making sure the correct products reach the correct customers and look amazing. <br\/>In addition you'll also be:<br\/>Managing all aspects of the kitchen, staff, suppliers, rotas, holiday, sickness and co-ordinating with our small customer service team on bespoke orders. <br\/>Assist and drive development with your team to work together and deliver amazing product and customer satisfaction<br\/>Foster an environment where each employee can grow professionally and personally whilst meeting the objectives of the business and having fun at work<br\/>Conduct monthly stocktake<br\/>Scheduling of staff hours and monthly rota to meet the requirements of the business whilst minimising unnecessary overtime<br\/>Assist with and manage cleaning duties in line with company expectations and EHO standards.<br\/>Box and package cakes, cupcakes and other bakery goods as directed by the company.<br\/>A passion for people, work and the Flavourtown brand. Always reflecting the positive and managing the negative within the team<br\/>Work well under pressure whilst maintaining a constant pace throughout the shift and managing the pace and speed of the operation. Identify weaknesses in the shift process and manage these with the team and if necessary, through HR processes.<br\/>Ability to be on your feet for hours at a time and lift within the expectations of any bakery environment.<br\/>You will ensure proper rotation of stock and ordering.<br\/>Deliver training to new staff members and monitor their progress closely whilst addressing issues with top-up training \/ retraining as necessary for the needs of the business<br\/>Ensure the baking and decorating standards expected by the company and always making sure that everything that leaves the production kitchen is of the Flavourtown brand standard.<br\/>Be the example! Flavourtown culture is evolving and you will be the ambassador for removing negativity and managing accepted standards for the kitchenYou are:<br\/>A natural leader who creates an environment in which employees aspire to great things in the way that they act, think and perform their jobs.<br\/>Committed to exceptional service, willingly going above and beyond to make the company excel.<br\/>A neat freak who happily enforces safety, cleaning, exceptional food handling, general cleanliness and maintenance of the kitchen. <br\/>A problem solver who can quickly create solutions for issues that arise<br\/>A leader that leads by example and inspires your team to constantly do their best<br\/>Detail oriented and positive by nature with a natural smile that is always on<br\/>The salary for this role is 35 - 40k per annum (depending on experience) plus a bonus scheme based on real results: Quality, efficiency, managing costs and staffing budgets along with wastage, cleaning and food safety standards. <\/p>","desirable_skills":"","experience":"","benefits":"<ul><li>29 DAYS ANNUAL HOLIDAY,<\/li><li>50% STAFF DISCOUNT,<\/li><li>FREE CAKE FOR YOUR BIRTHDAY,<\/li><li>TRAINING AND THE OPPORTUNITY FOR EXTERNAL COURSES,<\/li><li>BECOMING A PART OF THE SENIOR MANAGEMENT TEAM AND DRIVING NPD<\/li><li>DEVELOPING YOUR BUSINESS MANAGEMENT SKILLS WITH OUR OPS MANAGER,<\/li><li>CHANCE TO HELP MOVE THE BUSINESS ONTO THE NEXT LEVEL AND REAP THE REWARDS THAT COME WITH GROWTH <\/li><\/ul>"}},"712a74b2-2b4f-400f-bb41-bd6d653afc3f":{"type":"Job","settings":{"job_title":"HEAD CAKE DECORATOR ","summary_text":"We have a rare opening for an outstandingly experienced Head Cake Decorator! We're looking for someone with exceptional cake decorating skills who's comfortable leading our small talented team and has really high standards.","location":"park_royal","job_type":"full_time","salary":"£30K - £32K","years_experience":"","start_date":"","schedule":"","full_description":"<p>We have a rare opening for an outstandingly experienced Head Cake Decorator! We're looking for someone with exceptional cake decorating skills who's comfortable leading our small talented team and has really high standards.<\/p><p>This is an amazing opportunity for someone looking to take their first step into management whilst still getting to do what they love every day! This position has a great salary, excellent opportunities for promotion and a really supportive Production Manager and Assistant Production Manager who'll you'll work alongside with.<\/p><p>You'll need at least three to four years professional cake decorating experience for this position along with amazing skills in buttercream, Swiss meringue, ganache, cream cheese icing and fondant! Character modelling experience is also essential along with a strong wedding cake skill-set.<\/p><p>Along with a very attractive salary we're offering a £250 signing on bonus upon completing your probationary period and a performance related bonus based around your bespoke \/ wedding cake skills helping to develop our new range of Flavourtown wedding cakes.<\/p><p>One of the most important aspects of this role is that you will be leading the decorating of our daily cake and cupcake production and you'll be extremely comfortable in the head decorators shoes helping other team members sharpen their skills by teaching new methods and techniques as well as smashing out your own amazingly decorated cakes and cupcakes.<\/p>","essential_skills":"<p>Here's how the role breaks down<\/p><ul><li>Decorating our epic cakes to a high standard<\/li><li>Decorating, finishing and boxing our award winning cupcakes.<\/li><li>Managing the daily flow of decorating \/ prep \/ hand decorations<\/li><li>Setting the daily work plan with our Production Manager<\/li><li>Keeping quality at the highest possible levels and managing speed and efficiency.<\/li><li>Working with American, Swiss meringue and cream cheese buttercream and ganache.<\/li><li>Working quickly whilst maintaining a high level of quality and finish<\/li><li>Being part of the creative process - liaising with our Production Manager and Head of Customer service to help create an amazing Flavourtown cake experience for our customers.<\/li><li>You'll thrive on helping our gang of decorators sharpen their skills and get a kick out of seeing the whole team develop through sharing your knowledge.<\/li><li>Being part of daily production and jumping from decorating Rainbow Cakes to a three tier birthday cake<\/li><li>Be a willing team player, everyone that works with us is important to the company.<\/li><li>Professional cake decorating experience in a high volume commercial bakery environment is required alongside your one of a kind bespoke skills.<\/li><li>Able to work some weekends and an alternating shift pattern (5 days out of 7)<\/li><li>Assisting the Production Manager and Assistant Production Manager in the day to day management of the decorating team<\/li><\/ul><p>The skills you'll need for this role are<\/p><ul><li>At least three years cake decorating experience in a bakery production environment<\/li><li>Some people management skills<\/li><li>Placing orders and assisting the production Manager with ordering \/ stock control<\/li><li>Insane attention to detail<\/li><li>Outstanding bespoke cake decorating ability with really high level skills in fondant modelling and some sculpting experience<\/li><li>Unflappable with a huge interest and ability in current cake decorating techniques<\/li><li>Level 2 Food Safety<\/li><li>Expert piper and sugar crafter<\/li><li>Ability to work to a high standard under pressure<\/li><li>Must be UK based with the right to live and work here<\/li><li>Outstanding spoken and written English<\/li><li>You are artistic, fun, committed to work and the team, you don't come with any drama and you don't have a clock watching mentality.<\/li><\/ul>","desirable_skills":"","experience":"","benefits":"<p>WE OFFER<\/p><p>*An excellent salary of between £30 to £32k per annum based on experience<br\/>*£250 signing on bonus after successfully completing your three month probation<br\/>* Performance related bonus<br\/>* 29 days holiday (including one for your Birthday)<br\/>* 50% Staff discount<br\/>* Free birthday Cake<br\/>* Bags of training and development<br\/>*Courses and development<br\/>* The opportunity to do amazing things<\/p>"}},"e546978b-ea5c-478e-a149-2a38b61b8263":{"type":"Job","settings":{"job_title":"BAKER \/ DECORATORS: RICHMOND \/ FULHAM STORES","summary_text":"","location":"park_royal","job_type":"part_time","salary":"£11.00\/hour with guaranteed 160 hours per month","years_experience":"2+ years experience","start_date":"","schedule":"","full_description":"<p>We have an amazing career opportunities for exceptional cake decorators \/ bakers! If you have bags of experience making, baking and decorating amazing cakes and cupcakes coupled with a razor sharp eye for quality and detail then we need you on our team.<\/p><p>These roles are multi-skilled and you will be baking and decorating! If you're skills are sharper in one area more than the other don't worry! We have a full training programme to help you succeed and develop your skills. <\/p><p>Flavourtown is London's leading cake and cupcake bakery with a hard earned reputation for world class cake that tastes even better than it looks, we've been creating Freshly Baked Happiness since 2013 and our business is growing. We've never compromised on our core values of using amazing ingredients to create a best in class product, we've gone from a one man operation to having over thirty staff across our venues BUT our attention to detail and deliciousness still drives everything we do.<\/p><p>Our Fulham Bakery kitchen is responsible for creating a daily counter full of epic cakes, cupcakes, brownies and cookies, all baked in small batches to our exacting Flavourtown standards.<\/p><p>Your core skills centre around icing and decorating to a really high standard and the ability to work with all different kinds of bakery techniques from mixes to cookies and brownies. Everything we do is made from scratch! There's no mass production line and we only use world class ingredients.<\/p><p>Here's how the role breaks down<\/p><ul><li>Decorating our epic cakes to a high standard<\/li><li>Decorating and finishing our award winning cupcakes.<\/li><li>Working with American, Swiss meringue and cream cheese buttercream and ganache.<\/li><li>Working quickly whilst maintaining a high level of quality and finish<\/li><li>Making mixes, brownies and cookies<\/li><li>Making our frostings and handmade compotes and caramels.<\/li><li>Be a willing team player, everyone that works with us is important to the company.<\/li><li>Professional cake decorating experience in a high volume commercial bakery environment is required.<\/li><li>Making sure all cleaning and food safety standards are met and taking pride in your work environment.<\/li><li>Able to work weekends and an alternating shift pattern (5 days out of 7)<\/li><\/ul><p>We can't wait to hear from you! Pleas include pictures of your work with your application<\/p><p>YOU MUST ALREADY BE BASED IN THE UK WITH THE RIGHT TO LIVE AND WORK HERE﻿﻿﻿<\/p>","essential_skills":"<p>The skills you'll need for this role are<\/p><ul><li>At least two years cake decorating experience in a bakery production environment<\/li><li>Level 2 Food Safety<\/li><li>Mixing and baking to a high standard<\/li><li>Ability to work to a high standard under pressure<\/li><li>Must be UK based with the right to live and work here<\/li><li>Outstanding spoken and written English<\/li><li>You are artistic, fun, committed to work and the team, you don't come with any drama and you don't have a clock watching mentality.<\/li><\/ul>","desirable_skills":"","experience":"","benefits":"<p>WE OFFER<\/p><p>* Rates starting at £11.00 per hour with guaranteed 160 hours per month.<br\/>* Performance related bonus<br\/>* 29 days holiday (including one for your Birthday)<br\/>* 50% Staff discount<br\/>* Free birthday Cake<br\/>* Bags of training and development<br\/>* The opportunity to do amazing things<\/p>"}}},"block_order":["8bd26a80-afcc-4660-82c0-6e83df68a9ef","712a74b2-2b4f-400f-bb41-bd6d653afc3f","e546978b-ea5c-478e-a149-2a38b61b8263"],"disabled":true,"settings":{"title":"Current vacancies","to_apply":"<p>To apply for this position, please email a copy of your CV plus any relevant images to <a href=\"mailto:careers@flavourtownbakery.co.uk\" title=\"mailto:careers@flavourtownbakery.co.uk\">careers@flavourtownbakery.co.uk<\/a><\/p>"}}},"order":["rich_text_HkMyPL","rich_text_K6paVK","rich_text_bkP3rb","rich_text_XMx6iU","rich_text_6qWCzL","rich_text_KPPaXH","custom_liquid_7LQTLF","rich_text_mP4rA3","rich_text_bixTJR","rich_text_cmj8aN","rich_text_h6RAT6","rich_text_qnyFrf","main","3478d8e4-dcfd-439c-af1c-624239abf173","f4d4cfe6-0eff-4650-84dc-836db419c644","09f9c2a6-ab8b-4287-b7c8-5311cee9207c"]}